In [1]:
import pandas as pd
import numpy as np

In [2]:
names = ['George',
         'John',
         'Thomas',
         'James',
         'Andrew',
         'Martin',
         'William',
         'Zachary',
         'Millard',
         'Franklin']
purchases = pd.DataFrame(index=names)
purchases['country'] = ['US', 'CAN', 'CAN', 'US', 'CAN', 'US', 'US', 'US', 'CAN', 'US']
purchases['ad_views'] = [16, 42, 32, 13, 63, 19, 65, 23, 16, 77]
purchases['items_purchased'] = [2, 1, 0, 8, 0, 5, 7, 3, 0, 5]

In [3]:
purchases['country']

George       US
John        CAN
Thomas      CAN
James        US
Andrew      CAN
Martin       US
William      US
Zachary      US
Millard     CAN
Franklin     US
Name: country, dtype: object

In [5]:
# .loc ---> selector that indexes over rows and cols
# .iloc ---> same thing but over indices

purchases.loc['George', 'country']

'US'

In [6]:
purchases.iloc[1:3, 1]

John      42
Thomas    32
Name: ad_views, dtype: int64

In [7]:
#conditional selections with lambda
purchases.loc[lambda df: purchases['items_purchased'] > 1, :]

         country  ad_views  items_purchased
George        US        16                2
James         US        13                8
Martin        US        19                5
William       US        65                7
Zachary       US        23                3
Franklin      US        77                5

In [10]:
#condiotional selections with boolean logic
purchases[purchases['items_purchased'] > 1]

         country  ad_views  items_purchased
George        US        16                2
James         US        13                8
Martin        US        19                5
William       US        65                7
Zachary       US        23                3
Franklin      US        77                5

In [11]:
#groups
purchases.groupby('country')

In [12]:
#hmmmm....let's try something a little different!

purchases.groupby('country').aggregate(np.mean)

         ad_views  items_purchased
country
CAN         38.25             0.25
US          35.50             5.00